{
  "title": "Doa Perlindungan dan Mahabbah",
  "description": "Doa memohon perlindungan, kecintaan kepada Allah, dan kemudahan urusan dunia serta akhirat.",
  "data": [
    {
      "title": "Pembuka",
      "repeat": 1,
      "type": "single",
      "arabic": "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ ،",
      "latin": "Bismillāhir-raḥmānir-raḥīm(i).",
      "translation": "Dengan nama Allah Yang Maha Pengasih lagi Maha Penyayang."
    },
    {
      "title": "Pembuka",
      "repeat": 1,
      "type": "single",
      "arabic": "اللَّهُمَّ صَلِّ عَلَى سَيِّدِنَا مُحَمَّدٍ وَعَلَى آلِ سَيِّدِنَا مُحَمَّدٍ وَالْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ",
      "latin": "Allāhumma ṣalli ‘alā sayyidinā Muḥammad wa ‘alā āli sayyidinā Muḥammad, wal-ḥamdu lillāhi rabbil-‘ālamīn.",
      "translation": "Ya Allah, limpahkanlah shalawat kepada junjungan kami Nabi Muhammad, dan kepada keluarga Nabi Muhammad, dan segala puji bagi Allah Tuhan seluruh alam."
    },
    {
      "title": "Doa Perlindungan",
      "repeat": 1,
      "type": "single",
      "arabic": "اَللّٰهُمَّ إِنَّا نَعُوْذُ بِنُوْرِ قُدْسِكَ وَبَرَكَةِ طَهَارَتِكَ وَعُظْمِ جَلَالِكَ مِنْ كُلِّ طَارِقٍ إِلَّا طَارِقًا يَطْرُقُ بِخَيْرٍ إِنَّكَ عَلَى كُلِّ شَيْئٍ قَدِيْرٍ",
      "latin": "Allāhumma innā na‘ūżu binūri qudsika wa bibarakati ṭahāratika wa bi‘iẓami jalālika min kulli ṭāriqin illā ṭāriqan yaṭruqu bikhairin innaka ‘alā kulli syai’in qadīr.",
      "translation": "Ya Allah, sesungguhnya kami berlindung dengan cahaya kesucian-Mu, dengan keberkahan kesucian-Mu, dan dengan keagungan kemuliaan-Mu dari setiap yang datang di malam hari, kecuali yang datang dengan membawa kebaikan. Sesungguhnya Engkau Maha Kuasa atas segala sesuatu."
    },
    {
      "title": "Doa Perlindungan dan Penyerahan Diri",
      "repeat": 1,
      "type": "single",
      "arabic": "اَللّٰهُمَّ أَنْتَ غِيَاثُنَا فَبِكَ نَغُوْثُ . وَأَنْتَ عِيَاذُنَا فَبِكَ نَعُوْذُ . وَأَنْتَ مَلَاذُنَا فَبِكَ نَلُوْذُ . يَا مَنْ ذَلَّتْ لَهُ رِقَابُ الْجَبَابِرَةِ وَخَضَعَتْ لَهُ مَقَالِيْدُ الْفَرَاعِنَةِ . أَجِرْنَا مِنْ خِزْيِكَ وَعُقُوْبَتِكَ فِى لَيْلِنَا وَنَهَارِنَا وَنَوْمِنَا وَقَرَارِنَا لَاإِلٰهَ إِلَّا أَنْتَ . تَعْظِيْمًا لِوَجْهِكَ وَتَكْرِيْمًا لِسُبْحَاتِكَ فَاصْرِفْ عَنَّا شَرَّ عِبَادِكَ . اِجْعَلْنَا فِى حِفْظِ عِنَايَتِكَ . وَسُرَادِقَاتِ حِفْظِكَ . وَعُدْ عَلَيْنَا بِخَيْرٍ مِنْكَ يَا أَرْحَمَ الرَاحِمِينَ",
      "latin": "Allāhumma anta ghiyāṡunā fabika naghūtsu, wa anta ‘iyāżunā fabika na‘ūżu, wa anta malāżunā fabika nalūżu, yā man żallat lahu riqābul-jabābirati wa khaḍa‘at lahu maqālīdul-farā‘inah, ajirnā min khizyakika wa ‘uqūbatika fī lailinā wa nahārinā wa nauminā wa qarārinā lā ilāha illā anta ta‘ẓīman liwajhika wa takrīman lisubḥānika faṣrif ‘annā syarra ‘ibādika, ij‘alnā fī ḥifẓi ‘ināyatika wa surādiqi ḥifẓika wa ‘ud ‘alainā bikhairin minka yā arḥamar-rāḥimīn.",
      "translation": "Ya Allah Engkau adalah penolong kami, maka kepada-Mu kami mohon pertolongan, Engkau adalah pelindung kami, maka kepada-Mu kami mohon perlindungan, Engkau benteng kami, maka kepada-Mu kami mohon dibentengi. Wahai Dzat yang tunduk pada-Nya kesombongan, dan tunduk pada-Nya keangkuhan dan kecongkakan, selamatkanlah kami dari kehinaan dan siksa-Mu, saat malam kami, tidur kami, dan saat terjaga kami. Tidak ada Tuhan kecuali Engkau. Semata-mata karena mengagungkan wajah-Mu dan memuliakan kesucian-Mu, maka hindarkanlah kami dari kejahatan hamba-Mu. Masukkanlah kami ke dalam naungan pertolongan-Mu dan penjagaan-Mu. Kembalikanlah atas kami kebaikan dari-Mu, wahai Dzat yang Maha Pengasih lagi Maha Penyayang."
    },
    {
      "title": "Doa Perlindungan dari Kejahatan",
      "repeat": 1,
      "type": "single",
      "arabic": "اَللّٰهُمَّ إِنَّا نَجْعَلُكَ فِيْ نُحُوْرِهِمْ وَنَعُوْذُ بِكَ مِنْ شُرُوْرِهِمْ",
      "latin": "Allāhumma innā naj‘aluka fī nuḥūrihim wa na‘ūżu bika min syurūrihim.",
      "translation": "Ya Allah, sesungguhnya kami menjadikan Engkau di hadapan mereka (untuk mencegah mereka) dan kami berlindung kepada-Mu dari kejahatan mereka."
    },
    {
      "title": "Doa Memohon Cinta Allah",
      "repeat": 1,
      "type": "single",
      "arabic": "اَللّٰهُمَّ ارْزُقْنَا حُبَّكَ وَحُبَّ مَنْ يُحِبُّكَ وَالْعَمَلَ الَّذِى يُبَلِّغُنَا حُبَّكَ .  اَللّٰهُمَّ اجْعَلْ حُبَّكَ أَحَبَّ إِلَيْنَا مِنْ نَفْسِنَا وَمِنْ أَهْلِنَا وَمِنَ الْمَاءِ الْبَارِدِ",
      "latin": "Allāhummar-zuqnā ḥubbaka wa ḥubba man yuḥibbuka wal-‘amala-llażī yuballighunā ḥubbaka. Allāhummaj‘al ḥubbaka aḥabba ilainā min nufūsinā wa min ahlīnā wa minal-mā’il-bārid.",
      "translation": "Ya Allah beri kami cinta-Mu, dan cintanya orang yang mencintai-Mu, Tunjukkan kami amalan-amalan yang menyampaikan kami kepada cinta-Mu. Ya Allah jadikan cinta-Mu lebih kami cintai dari diri kami, keluarga kami, dan dari air yang dingin."
    },
    {
      "title": "Doa Memohon Cinta",
      "repeat": 1,
      "type": "single",
      "arabic": "اَللّٰهُمَّ إِنَّا نَسْأَلُكَ حُبَّكَ وَحُبَّ مَنْ يَنْفُعَنَا حُبُّهُ عِنْدَكَ . اَللّٰهُمَّ مَا رَزَقْتَنَا مِمَّا نُحِبُّ فَاجْعَلْهُ قُوَّةً لَنَا فِيْمَا تُحِبُّ . اَللّٰهُمَّ مَا زَوَيْتَ عَنَّا مِمَّا نُحِبُّ فَاجْعَلْهُ فَرَاغًا لَنَا فِيْمَا تُحِبُّ",
      "latin": "Allāhumma innā nas’aluka ḥubbaka wa ḥubba man yanfa‘unā ḥubbuhu ‘indaka, Allāhumma mā razaqtanā mimmā nuḥibbu faj‘alhu quwwatan lanā fīmā tuḥibbu, Allāhumma mā zawaita ‘annā mimmā nuḥibbu faj‘alhu farāghan lanā fīmā tuḥibbu.",
      "translation": "Ya Allah kami mohon kepada-Mu cinta-Mu dan cintanya orang yang memberi manfaat kepada kami, cintanya di sisi-Mu. Ya Allah apa yang Engkau berikan kepada kami dari apa yang kami cintai, jadikan kekuatan untuk kami menuju apa yang Engkau cintai. Ya Allah apa yang Engkau melarang kami dari apa yang kami cintai, maka jadikanlah kekosongan itu apa-apa yang mengantarkan kami menuju sesuatu yang Engkau cintai."
    },
    {
      "title": "Doa Memohon Ilmu, Rezeki, dan Amal",
      "repeat": 1,
      "type": "single",
      "arabic": "اَللّٰهُمَّ إِنَّا نَسْأَلُكَ عِلْمًا نَافِعًا وَرِزْقًا وَاسِعًا حَلَالًا طَيِّبًا مُبَاركَاً وَعَمَلًا مُتَقَبَّلًا",
      "latin": "Allāhumma innā nas’aluka ‘ilman nāfi‘an wa rizqan wāsi‘an ḥalālan ṭayyiban mubārakan wa ‘amalan mutaqabbalā.",
      "translation": "Ya Allah, sesungguhnya kami memohon kepada-Mu ilmu yang bermanfaat, rezeki yang luas, halal, baik, dan diberkahi, serta amal yang diterima."
    },
    {
      "title": "Doa Penambah Ilmu dan Pemahaman",
      "repeat": 1,
      "type": "single",
      "arabic": "رَبِّ زِدْنَا عِلْمًا وَارْزُقْنَا فَهْمًا",
      "latin": "Rabbi zidnā ‘ilman warzuqnā fahman.",
      "translation": "Ya Tuhanku, tambahkanlah ilmuku dan berilah aku pemahaman."
    },
    {
      "title": "Doa Memohon Kemudahan Urusan",
      "repeat": 1,
      "type": "single",
      "arabic": "اَللّٰهُمَّ يَسِّرْ لَنَا أُمُوْرَنَا . وَأُمُوْرَ وَالِدَيْنَا وَأُمُوْرَ أَسَاتِذَتِنَا وَأُسْتَاذَاتِنَا وَأُمُوْرَ مَعْهَدِنَا وَمُؤَسَّسَتِنَا (Yatim Mandiri) أُمُوْرَ الدُّنْيَا وَالْأٰخِرَةِ مَا دَامَتِ السَّمٰوَاتُ وَالْأَرْضُ . إِنَّكَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ",
      "latin": "Allāhumma yassir lanā umūranā, wa umūra wālidīnā, wa umūra asātidzinā wa ustadzātinā, wa umūra ma‘hadinā wa mu’assasatinā (Yatim Mandiri) umūrad-dunyā wal-ākhirati mā dāmatis-samāwātu wal-arḍ, innaka ‘alā kulli syai'in qadīr.",
      "translation": "Ya Allah, mudahkanlah bagi kami urusan-urusan kami, dan urusan-urusan orang tua kami, dan urusan-urusan guru-guru laki-laki kami dan guru-guru perempuan kami, dan urusan-urusan pondok kami dan yayasan kami (Yatim Mandiri), urusan-urusan dunia dan akhirat, selama langit dan bumi masih ada. Sesungguhnya Engkau Maha Kuasa atas segala sesuatu."
    },
    {
      "title": "Doa Kebaikan Dunia Akhirat",
      "repeat": 1,
      "type": "single",
      "arabic": "رَبَّنَا أَتِنَا فِى الدُّنْيَا حَسَنَةً وَفِي اْلأَخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ",
      "latin": "Rabbanā ātinā fid-dunyā ḥasanatan wa fil-ākhirati ḥasanatan wa qinā ‘ażāb an-nār.",
      "translation": "Ya Tuhan kami, berikanlah kami kebaikan di dunia dan kebaikan di akhirat. Lindungilah kami dari siksa api neraka."
    },
    {
      "title": "Doa Penutup",
      "repeat": 1,
      "type": "single",
      "arabic": "سُبْحَانَ رَبِّكَ رَبِّ الْعِزَّةِ عَمَّا يَصِفُوْنَ وَسَلَامٌ عَلَى الْمُرْسَلِيْنَ وَالْحَمْدُ لِلّٰهِ رَبِّ الْعَالَمِيْنَ",
      "latin": "Subḥānaka rabbi ka rabbi al-‘izzati ‘ammā yaṣifūn, wa salāmun ‘alā al-mursalīn, wa al-ḥamdu lillāhi rabbi al-‘ālamīn.",
      "translation": "Maha suci Tuhanmu yang mempunyai keperkasaan dari apa yang mereka katakan. Dan kesejahteraan dilimpahkan atas para Rasul. Dan segala puji bagi Allah, Tuhan seru sekalian alam."
    }
  ]
}
